In [13]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

In [14]:
airbnb_price = pd.read_csv("/Users/kajetanhanausek/Desktop/projects/Exploring the NYC Airbnb Market /data/airbnb_price.csv")

In [15]:
airbnb_price.shape

(25209, 3)

In [16]:
last_review = pd.read_csv("/Users/kajetanhanausek/Desktop/projects/Exploring the NYC Airbnb Market /data/airbnb_last_review.tsv",  sep='\t')

In [17]:
last_review.shape

(25209, 3)

In [18]:
room_type = pd.read_excel("/Users/kajetanhanausek/Desktop/projects/Exploring the NYC Airbnb Market /data/airbnb_room_type.xlsx")

In [19]:
room_type.shape

(25209, 3)

In [20]:
airbnb_price.info

<bound method DataFrame.info of        listing_id        price                 nbhood_full
0            2595  225 dollars          Manhattan, Midtown
1            3831   89 dollars      Brooklyn, Clinton Hill
2            5099  200 dollars      Manhattan, Murray Hill
3            5178   79 dollars   Manhattan, Hell's Kitchen
4            5238  150 dollars        Manhattan, Chinatown
...           ...          ...                         ...
25204    36425863  129 dollars  Manhattan, Upper East Side
25205    36427429   45 dollars            Queens, Flushing
25206    36438336  235 dollars  Staten Island, Great Kills
25207    36442252  100 dollars           Bronx, Mott Haven
25208    36455809   30 dollars          Brooklyn, Bushwick

[25209 rows x 3 columns]>

In [21]:
airbnb_price.describe()

         listing_id
count  2.520900e+04
mean   2.068922e+07
std    1.102928e+07
min    2.595000e+03
25%    1.202273e+07
50%    2.234391e+07
75%    3.037669e+07
max    3.645581e+07

In [22]:
airbnb_price.isnull().sum()

listing_id     0
price          0
nbhood_full    0
dtype: int64

In [23]:
last_review.head()

   listing_id    host_name   last_review
0        2595     Jennifer   May 21 2019
1        3831  LisaRoxanne  July 05 2019
2        5099        Chris  June 22 2019
3        5178     Shunichi  June 24 2019
4        5238          Ben  June 09 2019

In [24]:
last_review.head()

   listing_id    host_name   last_review
0        2595     Jennifer   May 21 2019
1        3831  LisaRoxanne  July 05 2019
2        5099        Chris  June 22 2019
3        5178     Shunichi  June 24 2019
4        5238          Ben  June 09 2019

In [25]:
### merging airbnb_price and last_review

main_table_1 = pd.merge(left = airbnb_price, right = last_review, how = "left", left_on = "listing_id", right_on ="listing_id")

In [26]:
### merging main_table_1 and room_type

main_table = pd.merge(left = main_table_1, right = room_type, how = "left", left_on = "listing_id", right_on ="listing_id")

In [27]:
main_table.head()

,listing_id,price,nbhood_full,host_name,last_review,description,room_type
0,2595,225 dollars,"Manhattan, Midtown",Jennifer,May 21 2019,Skylit Midtown Castle,Entire home/apt
1,3831,89 dollars,"Brooklyn, Clinton Hill",LisaRoxanne,July 05 2019,Cozy Entire Floor of Brownstone,Entire home/apt
2,5099,200 dollars,"Manhattan, Murray Hill",Chris,June 22 2019,Large Cozy 1 BR Apartment In Midtown East,Entire home/apt
3,5178,79 dollars,"Manhattan, Hell's Kitchen",Shunichi,June 24 2019,Large Furnished Room Near B'way,private room
4,5238,150 dollars,"Manhattan, Chinatown",Ben,June 09 2019,Cute & Cozy Lower East Side 1 bdrm,Entire home/apt

In [28]:
main_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   price        25209 non-null  object
 2   nbhood_full  25209 non-null  object
 3   host_name    25201 non-null  object
 4   last_review  25209 non-null  object
 5   description  25199 non-null  object
 6   room_type    25209 non-null  object
dtypes: int64(1), object(6)
memory usage: 1.3+ MB

In [29]:
main_table.describe()

         listing_id
count  2.520900e+04
mean   2.068922e+07
std    1.102928e+07
min    2.595000e+03
25%    1.202273e+07
50%    2.234391e+07
75%    3.037669e+07
max    3.645581e+07

In [30]:
### Casting price as an integer
main_table["price"] = main_table["price"].str.replace("dollars", "").astype(int)

In [31]:
main_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   price        25209 non-null  int64
 2   nbhood_full  25209 non-null  object
 3   host_name    25201 non-null  object
 4   last_review  25209 non-null  object
 5   description  25199 non-null  object
 6   room_type    25209 non-null  object
dtypes: int64(2), object(5)
memory usage: 1.3+ MB

In [32]:
### Casting listing_id as a string
main_table["listing_id"] = main_table["listing_id"].astype(str)

In [33]:
main_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  object
 1   price        25209 non-null  int64
 2   nbhood_full  25209 non-null  object
 3   host_name    25201 non-null  object
 4   last_review  25209 non-null  object
 5   description  25199 non-null  object
 6   room_type    25209 non-null  object
dtypes: int64(1), object(6)
memory usage: 1.3+ MB

In [34]:
### Casting last_review as a date
main_table["last_review"] = pd.to_datetime(main_table["last_review"])

In [35]:
main_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  object
 1   price        25209 non-null  int64
 2   nbhood_full  25209 non-null  object
 3   host_name    25201 non-null  object
 4   last_review  25209 non-null  datetime64[ns]
 5   description  25199 non-null  object
 6   room_type    25209 non-null  object
dtypes: datetime64[ns](1), int64(1), object(5)
memory usage: 1.3+ MB

In [36]:

### Determining the most recent review dates for the private rooms

pri_room_last_rev = main_table["last_review"][main_table["room_type"] == "private room"].max()
pri_room_last_rev

Timestamp('2019-07-08 00:00:00')

In [37]:
### Determining the earliest review dates for the private rooms

pri_room_first_rev = main_table["last_review"][main_table["room_type"] == "private room"].min()
pri_room_first_rev

Timestamp('2019-01-01 00:00:00')

In [38]:
main_table.describe()

              price                    last_review
count  25209.000000                          25209
mean     141.777936  2019-05-30 07:58:41.171010560
min        0.000000            2019-01-01 00:00:00
25%       69.000000            2019-05-23 00:00:00
50%      105.000000            2019-06-18 00:00:00
75%      175.000000            2019-06-29 00:00:00
max     7500.000000            2019-07-09 00:00:00
std      147.349137                            NaN

In [39]:
### Finding how many listings are private rooms

private_rooms_df = main_table[main_table['room_type'] == 'private room'].count()

In [40]:
private_rooms_df

listing_id     2248
price          2248
nbhood_full    2248
host_name      2247
last_review    2248
description    2245
room_type      2248
dtype: int64

In [41]:
private_rooms_df_2 = main_table['room_type'][main_table['room_type'] == 'private room'].count()

In [42]:
private_rooms_df_2

2248

In [43]:
### Finding the average price of listings for private room

priv_room_avg_price = main_table["price"][main_table["room_type"] == "private room"].mean()
priv_room_avg_price

80.37455516014235

In [48]:
### creating dictionary with 4 previously calculated values

review_dates = {"first_reviewed": pri_room_first_rev, "last_reviewed": pri_room_last_rev, "nb_private_rooms": private_rooms_df_2,"avg_price": priv_room_avg_price, "index": 0}

In [49]:
review_dates_2 = pd.DataFrame(review_dates, index=[0])
review_dates_2

  first_reviewed last_reviewed  nb_private_rooms  avg_price  index
0     2019-01-01    2019-07-08              2248  80.374555      0